In [ ]:
from urllib.parse import quote_plus

import pandas as pd
from sqlalchemy import create_engine

username = quote_plus("root")
password = quote_plus("pasword")
server = "127.0.0.1:3306"
db_name = "TESTDB"

conn = create_engine(
    f"mysql+pymysql://{username}:{password}@{server}/{db_name}?autocommit=true",
).connect()

In [4]:
quote_plus("@")

'%40'

In [8]:
df = pd.read_sql(
    "select * from Staff",
    conn,
)

df

    ID   Name DeptId  Age Gender  Salary            recordDt
0  001   Mike    002   45      M   60000 2020-10-13 21:41:49
1  002   Judy    002   30      F   48000 2020-10-13 21:41:49
2  003  Allen    001   22      M   50000 2020-10-13 21:41:49
3  004    Tom    002   47      M   47000 2020-10-13 21:41:49
4  005   Jack    003   36      M   52000 2020-10-13 21:41:49
5  006   Abby    002   24      F   45000 2020-10-13 21:41:49
6  007  Trump    001   80      M   80000 2020-10-13 21:41:49
7  008  Marry    003   29      F   87000 2020-10-13 21:41:49

In [10]:
df["ID"] = df["ID"].str.replace("00", "01")
df

    ID   Name DeptId  Age Gender  Salary            recordDt
0  011   Mike    002   45      M   60000 2020-10-13 21:41:49
1  012   Judy    002   30      F   48000 2020-10-13 21:41:49
2  013  Allen    001   22      M   50000 2020-10-13 21:41:49
3  014    Tom    002   47      M   47000 2020-10-13 21:41:49
4  015   Jack    003   36      M   52000 2020-10-13 21:41:49
5  016   Abby    002   24      F   45000 2020-10-13 21:41:49
6  017  Trump    001   80      M   80000 2020-10-13 21:41:49
7  018  Marry    003   29      F   87000 2020-10-13 21:41:49

In [11]:
df.to_sql(
    "Staff",
    conn,
    if_exists="append",
    index=False,
)

8

In [12]:
conn.commit()

In [13]:
df.to_sql(
    "Staff",
    conn,
    if_exists="replace",
    index=False,
)

8

In [14]:
df.to_csv("staff.csv")

In [15]:
df.to_sql(
    "Staff",
    conn,
    if_exists="replace",
)

8

In [16]:
conn.close()

In [17]:
with create_engine(
    f"mysql+pymysql://{username}:{password}@{server}/{db_name}?autocommit=true",
).connect() as conn:
    df = pd.read_sql(
        "select * from Staff",
        conn,
    )

df

   index   ID   Name DeptId  Age Gender  Salary            recordDt
0      0  011   Mike    002   45      M   60000 2020-10-13 21:41:49
1      1  012   Judy    002   30      F   48000 2020-10-13 21:41:49
2      2  013  Allen    001   22      M   50000 2020-10-13 21:41:49
3      3  014    Tom    002   47      M   47000 2020-10-13 21:41:49
4      4  015   Jack    003   36      M   52000 2020-10-13 21:41:49
5      5  016   Abby    002   24      F   45000 2020-10-13 21:41:49
6      6  017  Trump    001   80      M   80000 2020-10-13 21:41:49
7      7  018  Marry    003   29      F   87000 2020-10-13 21:41:49

In [18]:
len(df)

8

In [19]:
df.__len__()

8